api/core_onvif/send/getMedia.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/device/wsdl" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:sch="http://www.onvif.org/ver10/schema"><soap:Body><wsdl:GetCapabilities><wsdl:Category>Media</wsdl:Category></wsdl:GetCapabilities></soap:Body></soap:Envelope>