messages/ws_get_services.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
    <soap:Body>
        <tds:GetServices>
            <tds:IncludeCapability>false</tds:IncludeCapability>
        </tds:GetServices>
    </soap:Body>
</soap:Envelope>