tests/tests/test_getservices.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
   <soap:Header/>
   <soap:Body>
      <tds:GetServices>
         <tds:IncludeCapability>true</tds:IncludeCapability>
      </tds:GetServices>
   </soap:Body>
</soap:Envelope>
